In [1]:
import sqlite3
import pandas as pd

In [2]:
def run_query(q):
    with sqlite3.connect('WarioINC.db') as conn:
        return pd.read_sql(q, conn)

In [4]:
def run_command(c):
    with sqlite3.connect('WarioINC.db') as conn:
        conn.isolation_level = None
        conn.execute(c)

In [12]:
create_employees = '''CREATE TABLE employees (
                      employee_id int PRIMARY KEY,
                      address_id int,
                      department_id int,
                      name varchar (255),
                      age int,
                      salary bigint,
                      FOREIGN KEY(department_id) REFERENCES departments(departments_id)
                      FOREIGN KEY(address_id) REFERENCES addresses (address_id)
                      )
'''

In [11]:
#run_command('DROP TABLE employees')

In [13]:
run_command(create_employees)

In [19]:
create_addresses = '''CREATE TABLE addresses (
                      address_id int PRIMARY KEY,
                      street varchar (255),
                      city varchar (255),
                      state varchar (2),
                      FOREIGN KEY (address_id) REFERENCES employees (address_id)
                      )
'''

In [20]:
run_command(create_addresses)

In [18]:
run_command('DROP TABLE addresses')

In [21]:
create_departments = '''CREATE TABLE departments (
                        department_id int PRIMARY KEY,
                        department_name varchar (255),
                        manager_id int,
                        address_id int,
                        FOREIGN KEY (manager_id) REFERENCES employee (employee_id),
                        FOREIGN KEY (address_id) REFERENCES employee (address_id)
)
'''

In [22]:
run_command (create_departments)

In [23]:
def show_tables():
    query = '''SELECT
                  name,
                  type
               FROM sqlite_master
               WHERE type IN ("table","view");'''
    return run_query(query)

In [24]:
show_tables()

          name   type
0    employees  table
1    addresses  table
2  departments  table

In [26]:
run_query ('SELECT * FROM employees')

Empty DataFrame
Columns: [employee_id, address_id, department_id, name, age, salary]
Index: []

In [27]:
run_query ('SELECT * FROM addresses')

Empty DataFrame
Columns: [address_id, street, city, state]
Index: []

In [28]:
run_query ('SELECT * FROM departments')

Empty DataFrame
Columns: [department_id, department_name, manager_id, address_id]
Index: []